wisteria-1c/Конфигурация/Documents/ПодтверждениеНулевойСтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПодтверждениеНулевойСтавкиНДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПродаж</xr:Item>
				<xr:Item>AccumulationRegister.НДСРеализация0</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленныйРеализация0</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяПрочихРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦенности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Покупатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОтгрузки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СобытияПоНДСПродажи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродажиСНДС0</Name>
							<Comment>Сумма продаж, по которым применяется ставка НДС 0%</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсоваяРазница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФактураВыданный</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодыОперацийПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтредактированыСтрокиКодовОпераций</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыОперацийНалоговаяБаза</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НесырьевыеТовары</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродажиСНДС0</Name>
							<Comment>Сумма продаж, по которым применяется ставка НДС 0%</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/СобытияПоНДСПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СобытияПоНДСПродажи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолученАванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСНачисленКУплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвержденаСтавка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодтвержденаСтавка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДССкорректирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогИсчисляетПокупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеНДС0</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Documents/ПодтверждениеНулевойСтавкиНДС/Forms/ФормаКодовОпераций/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	Если ЭтоИнтерфейсТакси Тогда
		ПараметрыРазмещения.КоманднаяПанель = КоманднаяПанель;
	КонецЕсли;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры,
	"КлючСтроки,АдресТаблицыКодыОперацийНалоговаяБаза,
	|ДокументОтгрузкиПродажиСНДС0,ДокументОтгрузкиСуммаНДС,
	|ОтредактированыСтрокиКодовОпераций,Событие,Дата,Организация,
	|ВерсияПостановления1137,Покупатель,ДокументОтгрузки");
	
	ИсключитьПустоеЗначение = Новый Массив;
	ИсключитьПустоеЗначение.Добавить("");
	ТаблицаВыбора.Загрузить(УчетНДС.КлассификаторКодовОперацийПоСтавке0(Параметры.Дата,,ИсключитьПустоеЗначение));
	
	ТаблицаКодыОперацийНалоговаяБаза = ПолучитьИзВременногоХранилища(АдресТаблицыКодыОперацийНалоговаяБаза);
	
	Объект.КодыОперацийНалоговаяБаза.Очистить();
	Объект.КодыОперацийНалоговаяБаза.Загрузить(ТаблицаКодыОперацийНалоговаяБаза);
	
	Элементы.КодыОперацийНалоговаяБаза.Доступность = Параметры.ОтредактированыСтрокиКодовОпераций;
	
	Если Событие = Перечисления.СобытияПоНДСПродажи.ПодтвержденаСтавка0 Тогда
		Элементы.КодыОперацийНалоговаяБазаСуммаНДС.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ОбновитьПодвал(ЭтотОбъект);
	
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗавершениеРаботы И (Модифицированность ИЛИ ПеренестиВДокумент) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность И НЕ ПеренестиВДокумент Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытиемФормыЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
	КонецЕсли;
	
	Если ПеренестиВДокумент И НЕ Отказ Тогда
		Отказ = НЕ ПроверитьЗаполнениеНаКлиенте();
	КонецЕсли;
	
	Если Отказ Тогда
		ПеренестиВДокумент = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ПеренестиВДокумент Тогда
		
		СтруктураРезультат = ПриЗакрытииНаСервере();
		
		Оповестить("РедактированиеСпискаКодовОпераций", СтруктураРезультат, ВладелецФормы);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтредактированыСтрокиКодовОперацийПриИзменении(Элемент)
	
	Элементы.КодыОперацийНалоговаяБаза.Доступность = ОтредактированыСтрокиКодовОпераций;
	
	Если НЕ ОтредактированыСтрокиКодовОпераций Тогда
		
		Если Строка(Событие) = "Не подтверждена ставка 0%" Тогда
			
			Если ВерсияПостановления1137 >= 3 Тогда
				
				ПерерасчетКодовОпераций();
				
			КонецЕсли;
			
		Иначе
			
			Если ВерсияПостановления1137 >= 3 Тогда
				
				ПерерасчетКодовОпераций();
				
			Иначе
				
				Для Каждого СтрокаКодаОперации Из Объект.КодыОперацийНалоговаяБаза Цикл
					
					СтрокаКодаОперации.СуммаНДС = 0;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКодыОперацийНалоговаяБаза

&НаКлиенте
Процедура КодыОперацийНалоговаяБазаПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура КодыОперацийНалоговаяБазаПриНаведении(Элемент, Строка, Поле)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура КодыОперацийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ДанныеСтроки = Элементы.КодыОперацийНалоговаяБаза.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		ДанныеСтроки.КлючСтроки = КлючСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя <> "КодыОперацийНалоговаяБазаКодОперации" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Выбор кода операции");
	ПараметрыФормы.Вставить("ТаблицаЗначений", ТаблицаВыбора);
	ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура("Код",
		Элементы.КодыОперацийНалоговаяБаза.ТекущиеДанные.КодОперации));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиКодОперацииНалоговаяБазаЗавершение", ЭтотОбъект,
		Элементы.КодыОперацийНалоговаяБаза.ТолькоПросмотр);
	
	ОткрытьФорму("Обработка.ОбщиеОбъектыРеглОтчетности.Форма.ФормаВыбораЗначенияИзТаблицы", ПараметрыФормы,
		ЭтотОбъект, , , , ОписаниеОповещения, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КодыОперацийПриИзменении(Элемент)
	
	ОбновитьПодвал(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ПеренестиВДокумент = Истина;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросПередЗакрытиемФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПеренестиВДокумент = Истина;
		Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		ПеренестиВДокумент = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеНаКлиенте()
	
	Отказ = Ложь;
	
	#Область ПроверкаКодовОперацийНалоговаяБаза
	
	ИтогоПродажиСНДС0 = Объект.КодыОперацийНалоговаяБаза.Итог("ПродажиСНДС0");
	ИтогоСуммаНДС = Объект.КодыОперацийНалоговаяБаза.Итог("СуммаНДС");
	
	Если ДокументОтгрузкиПродажиСНДС0 <> ИтогоПродажиСНДС0 Тогда
		
		Текст = НСтр("ru = 'Итоговая сумма по кодам операций в колонке ""Продажи с НДС 0%""'") + " " + СтрШаблон(НСтр(
			"ru = '%1 не совпадает со значением %2 по документу отгрузки.'"), ИтогоПродажиСНДС0,
			ДокументОтгрузкиПродажиСНДС0);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "ДокументОтгрузкиПродажиСНДС0", , Отказ);
		
	КонецЕсли;
	
	Если ДокументОтгрузкиСуммаНДС <> ИтогоСуммаНДС Тогда
		
		Текст = СтрШаблон(НСтр(
			"ru = 'Итоговая сумма по кодам операций в колонке ""НДС"" %1 не совпадает со значением %2 по документу отгрузки.'"),
			ИтогоСуммаНДС, ДокументОтгрузкиСуммаНДС);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "ДокументОтгрузкиСуммаНДС", , Отказ);
		
	КонецЕсли;
	
	ИмяСписка = НСтр("ru = 'Налоговая база'");
	
	МассивКодовОпераций = Новый Массив;
	
	Для Индекс = 0 По Объект.КодыОперацийНалоговаяБаза.Количество() - 1 Цикл
		
		СтрокаКодыОпераций = Объект.КодыОперацийНалоговаяБаза[Индекс];
		Префикс = "Объект.КодыОперацийНалоговаяБаза[%1]";
		Префикс = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Префикс, Формат(Индекс, "ЧН=0; ЧГ="));
		
		Если Не ЗначениеЗаполнено(СтрокаКодыОпераций.КодОперации) Тогда
			Поле = Префикс + ".КодОперации";
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Код операции'"),
			Индекс + 1, ИмяСписка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Поле, , Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаКодыОпераций.ПродажиСНДС0) Тогда
			Поле = Префикс + ".ПродажиСНДС0";
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Продажи с НДС 0%'"),
			Индекс + 1, ИмяСписка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Поле, , Отказ);
		КонецЕсли;
		
		Отбор = Новый Структура();
		Отбор.Вставить("КодОперации", СтрокаКодыОпераций.КодОперации);
		Отбор.Вставить("НесырьевыеТовары", СтрокаКодыОпераций.НесырьевыеТовары);
		СтрокиТаблицы = Объект.КодыОперацийНалоговаяБаза.НайтиСтроки(Отбор);
		
		Если СтрокиТаблицы.Количество() > 1 И ЗначениеЗаполнено(СтрокаКодыОпераций.КодОперации) Тогда
			Текст = СтрШаблон(НСтр("ru = 'В строке %1 повторно указана комбинация кода операции %2 и признака ""Несырьевые товары "" %3.'"),
			Индекс + 1,
			СтрокаКодыОпераций.КодОперации,
			СтрокаКодыОпераций.НесырьевыеТовары);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			,
			"КодыОперацийНалоговаяБаза["+Индекс+"].КодОперации",
			,
			Отказ);
		КонецЕсли;
		
		МассивКодовОпераций.Добавить(СтрокаКодыОпераций.КодОперации);
		
	КонецЦикла;
	
	#КонецОбласти
	
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Функция ПриЗакрытииНаСервере()
	
	ТаблицаКодыОперацийНалоговаяБаза = Объект.КодыОперацийНалоговаяБаза.Выгрузить();
	АдресТаблицыКодыОперацийНалоговаяБаза = ПоместитьВоВременноеХранилище(ТаблицаКодыОперацийНалоговаяБаза,
		УникальныйИдентификатор);
	
	СтруктураРезультат = Новый Структура();
	СтруктураРезультат.Вставить("КлючСтроки", КлючСтроки);
	СтруктураРезультат.Вставить("АдресТаблицыКодыОперацийНалоговаяБаза", АдресТаблицыКодыОперацийНалоговаяБаза);
	СтруктураРезультат.Вставить("ОтредактированыСтрокиКодовОпераций", ОтредактированыСтрокиКодовОпераций);
	
	Возврат СтруктураРезультат;
	
КонецФункции

&НаКлиенте
Процедура ВвестиКодОперацииНалоговаяБазаЗавершение(РезультатВыбора, ТолькоПросмотр) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТолькоПросмотр Тогда
		Элементы.КодыОперацийНалоговаяБаза.ТекущиеДанные.КодОперации = РезультатВыбора.Код;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПодвал(Форма)
	
	Объект = Форма.Объект;
	Форма.НадписьВсегоНалоговаяБаза = Объект.КодыОперацийНалоговаяБаза.Итог("ПродажиСНДС0");
	Форма.НадписьВсегоНДС = Объект.КодыОперацийНалоговаяБаза.Итог("СуммаНДС");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерерасчетКодовОпераций()
	
	Данные = Новый Структура;
	Данные.Вставить("КлючСтроки", КлючСтроки);
	Данные.Вставить("ДокументОтгрузки", ДокументОтгрузки);
	Данные.Вставить("Покупатель", Покупатель);
	Данные.Вставить("Событие", Событие);
	Если ТипЗнч(ДокументОтгрузки) = Тип("ДокументСсылка.ДокументРасчетовСКонтрагентом") Тогда
		Данные.Вставить("ПродажиСНДС0", ДокументОтгрузкиПродажиСНДС0);
	КонецЕсли;
	
	ВладелецФормы.ПолучитьСуммыПоДокументуОтгрузки(Данные);
	
	Отбор = Новый Структура ("КлючСтроки", КлючСтроки);
	НайденныеСтроки = ВладелецФормы.Объект.КодыОперацийНалоговаяБаза.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Объект.КодыОперацийНалоговаяБаза.Очистить();
		
		Для Каждого Строка Из НайденныеСтроки Цикл
			
			НоваяСтрока = Объект.КодыОперацийНалоговаяБаза.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
		КонецЦикла;
		
	Иначе
		
		Объект.КодыОперацийНалоговаяБаза.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси() 
	
	Если Не ЭтоИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГлобальныеКоманды", "Видимость",
		ЭтоИнтерфейсТакси);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.КодыОперацийНалоговаяБаза);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.КодыОперацийНалоговаяБаза);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.КодыОперацийНалоговаяБаза);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
